app/views/halls/_form.html.haml

      .col-lg-8
        = f.input :parent_id, collection: Hall.where(:event_id => @hall.event_id).order(:name), :label_method => :name, :value_method => :id, :label => false, include_blank: true, class: "form-control"
---
SELECT "halls".* FROM "halls"  WHERE "halls"."event_id" = 1  ORDER BY "halls"."name" ASC