app/views/halls/show.html.haml

  - box 6, "Booths" do
    -@hall.booths.each do |booth|
---
SELECT "booths".* FROM "booths"  WHERE "booths"."hall_id" = $1  [["hall_id", 1]]