app/views/halls/main_hall_v2/_main_hall_v2.html.haml

SELECT  "events".* FROM "events"  WHERE (event_url like '%localhost%')  ORDER BY "events"."id" ASC LIMIT 1
---
-knowledge_hall = event.knowledge_hall
-if event.event_welcome_text.present?