app/views/contents/index.html.haml

            %td
              - content.booths.each do |booth|
---
SELECT "booths".* FROM "booths" INNER JOIN "booths_contents" ON "booths"."id" = "booths_contents"."booth_id" WHERE "booths_contents"."content_id" = $1  [["content_id", 1]]

            %td
              - content.halls.each do |hall|
---
SELECT "halls".* FROM "halls" INNER JOIN "contents_halls" ON "halls"."id" = "contents_halls"."hall_id" WHERE "contents_halls"."content_id" = $1  [["content_id", 1]]