app/views/events/_event_dashboard.html.haml

SELECT  "events".* FROM "events"  WHERE (event_url like '%localhost%')  ORDER BY "events"."id" ASC LIMIT 1
---
          %td
            - if event.event_favicon.present?
              .thumbnail