app/views/events/_events.html.haml

SELECT  "events".* FROM "events"  WHERE (event_url like '%localhost%')  ORDER BY "events"."id" ASC LIMIT 1
---
            -if event.live? or can?(:_basic_admin, event)
              = link_to event.name, event.event_url.present? && event.live? ? event.event_url : event_path(event)