app/views/events/_form.html.haml

    = f.input :event_url, :input_html => { class: "url form-control" }
    = f.association :landing_hall, collection: @event.halls.order(:name), include_blank: false, input_html: {class: "chosen"}
---
SELECT "halls".* FROM "halls"  WHERE "halls"."event_id" = $1  ORDER BY "halls"."name" ASC  [["event_id", 1]]