app/views/events/_hall_structure.html.haml

SELECT "booths".* FROM "booths"  WHERE "booths"."hall_id" = $1  [["hall_id", 2]]
---
        %ul
          - child_hall.booths.each do |booth|