app/views/events/show.html.haml

      %b Authentication Model
      -@event.auth_models.each do |authModel|
---
SELECT "auth_models".* FROM "auth_models"