app/views/tags/show.html.haml

      %b Booths
      -@tag.booths.each do |booth|
---
SELECT "booths".* FROM "booths" INNER JOIN "booths_tags" ON "booths"."id" = "booths_tags"."booth_id" WHERE "booths_tags"."tag_id" = $1  [["tag_id", 1]]

      %b Content
      -@tag.contents.each do |content|
---
SELECT "contents".* FROM "contents" INNER JOIN "contents_tags" ON "contents"."id" = "contents_tags"."content_id" WHERE "contents_tags"."tag_id" = $1  [["tag_id", 1]]