app/views/devise/sessions/_layout1.html.haml

SELECT "auth_models".* FROM "auth_models"
---
-auth_models = nil
-auth_models = @current_event.auth_models if @current_event.present?

SELECT  "events".* FROM "events"  WHERE (event_url like '%localhost%')  ORDER BY "events"."id" ASC LIMIT 1
---
        %br
  -elsif @current_event.present? and @current_event.event_image.present?
    .row
      .col-md-12.text-center