app/controllers/booths_controller.rb

SELECT "chats".* FROM "chats"  WHERE "chats"."chattable_id" = $1 AND "chats"."chattable_type" = $2  ORDER BY "chats"."created_at" ASC  [["chattable_id", 1], ["chattable_type", "Booth"]]
---
  def visit
    @chats = Chat.where(:chattable_type => 'Booth', :chattable_id => @booth.id)

SELECT  "booths".* FROM "booths"  WHERE "booths"."hall_id" = $1 AND (name < 'MARCS Model Aircraft Society, Victoria')  ORDER BY "booths"."name" DESC LIMIT 1  [["hall_id", 4]]
---
  def set_prev_next_booth
    allBoothsInHall = @booth.hall.published_booths
    @prev_booth = allBoothsInHall.where("name < ?", @booth.name).order(:name => :desc).first

SELECT  "events".* FROM "events"  WHERE (event_url like '%localhost%')  ORDER BY "events"."id" ASC LIMIT 1
---
  def new
    @booth = Booth.new
    @booth.event = @event
    @booth.template = @templates.first if @templates.size == 1

INSERT INTO "booths" ("about_us", "button1_content", "button1_label", "company_website", "contact_info", "created_at", "email", "event_id", "facebook_url", "greeting_video", "greeting_video_enabled", "hall_id", "linkedin_url", "name", "newsletter_description", "prize_giveaway_description", "public_chat", "survey_url", "template_id", "ticker_message", "top_message", "twitter_hash_tag", "twitter_roll", "twitter_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26) RETURNING "id"
---
  def create
    @booth = Booth.new(booth_params)
    @booth.save

UPDATE "booths" SET "top_message" = $1, "updated_at" = $2 WHERE "booths"."id" = 1
---
  def update
    @booth.update(booth_params)

SELECT  "templates".* FROM "templates"  WHERE "templates"."template_type" = 'booth'  ORDER BY "templates"."id" ASC LIMIT 1
---
    def set_templates
      @templates = Template.where(template_type: :booth)