app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents"  WHERE "contents"."event_id" = 1
---
  def index
    if (@event)
      @contents = Content.where(event: @event)

SELECT  "events".* FROM "events"  WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "halls".* FROM "halls"  WHERE "halls"."event_id" = $1  [["event_id", 1]]
---
  def new
    @content = Content.new()

    @content.owner_user = current_user
    if @booth_rep_booth.present?
      @content.booths << @booth_rep_booth
    end
    @content.privacy = @event.privacy

    @content.event = @event
    #Extract the event from the user's events - for booth reps
    @content.event = @content.booths.first.hall.event if @content.event.nil? and @content.booths.present?

INSERT INTO "contents" ("content_type", "created_at", "description", "external_id", "featured", "name", "owner_user_id", "privacy", "short_desc", "updated_at", "venue_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @content = Content.new(content_params)
    clenseContent()
    @content.save

UPDATE "contents" SET "description" = $1, "updated_at" = $2 WHERE "contents"."id" = 1  [["description", "Descriptive text goes in here. Hopefully it will make this all look a little better... could just make everything worse. oh well."], ["updated_at", "2014-11-12 15:19:50.309894"]]
---
  def update
    @content.assign_attributes(content_params)
    clenseContent()
    @content.save