app/controllers/events_controller.rb

SELECT "halls".* FROM "halls"  WHERE (("halls"."ancestry" ILIKE '1/%' OR "halls"."ancestry" = '1'))  ORDER BY (case when halls.ancestry is null then 0 else 1 end), halls.ancestry
---
  def show
    @halls = Hall.where(ancestry: nil, event_id: @event.id)

UPDATE "events" SET "additional_info" = $1, "event_welcome_heading" = $2, "event_welcome_text" = $3, "main_sponsor_url" = $4, "main_tagline" = $5, "privacy" = $6, "sponsor_tagline" = $7, "updated_at" = $8 WHERE "events"."id" = 1
---
  def update
    @event.update(event_params)

SELECT  "events".* FROM "events"  WHERE (event_url like '%localhost%')  ORDER BY "events"."id" ASC LIMIT 1
SELECT  "halls".* FROM "halls"  WHERE "halls"."id" = $1 LIMIT 1  [["id", 1]]
---
  def dashboard
    UtmCampaign.create_campaign(session, request, params)

    if current_user.nil? or current_user.is_visitor?
      if (@current_event.present? and (current_user.present? or @current_event.public_scope?))
        if @current_event.live? or (@current_event.landing_hall.present? and @current_event.landing_hall.template.template_type.to_sym == :mainHall)
          redirect_to event_landing_path(@current_event)
        else
          @events = get_public_events
        end
      else
        @events = get_public_events
      end
    elsif current_user.has_role?(:booth_rep)
      @booths = current_user.booths
      @event = @booths.first.hall.event if @booths.present? and @booths.first.present?