app/controllers/halls_controller.rb

SELECT "halls".* FROM "halls"  WHERE "halls"."event_id" = $1  ORDER BY "halls"."name" ASC  [["event_id", 1]]
---
  def index
    @halls = Event.find(params[:event_id]).halls.order(:name)

INSERT INTO "halls" ("ancestry", "colour", "created_at", "description", "greeting", "greeting_enable", "greeting_type", "hall_type", "jumbotron", "jumbotron_enable", "name", "template_id", "title", "updated_at", "venue_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @hall = Hall.new(page_params)
    @hall.save

UPDATE "halls" SET "colour" = $1, "description" = $2, "greeting" = $3, "greeting_enable" = $4, "greeting_type" = $5, "hall_type" = $6, "jumbotron" = $7, "jumbotron_enable" = $8, "title" = $9, "updated_at" = $10 WHERE "halls"."id" = 1
---
  def update
    @hall.update(page_params)