app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all.select {|product| can? :index, product}