app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(content_params)
    @tag.save
---
INSERT INTO "tags" ("created_at", "featured", "name", "updated_at", "venue_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-12 16:34:01.776862"], ["featured", "f"], ["name", "Kitesurfing"], ["updated_at", "2014-09-12 16:34:01.776862"], ["venue_id", 1]]

  def update
    @tag.update(content_params)
---
UPDATE "tags" SET "featured" = $1, "updated_at" = $2 WHERE "tags"."id" = 1  [["featured", "t"], ["updated_at", "2014-09-19 20:00:54.188206"]]