app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT "templates".* FROM "templates"

  def create
    @template = Template.new(template_params)
    build_resources
    @template.save
---
INSERT INTO "templates" ("created_at", "name", "template_sub_type", "template_type", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-10 10:01:51.830636"], ["name", "Main Hall"], ["template_sub_type", "main_hall_v2"], ["template_type", "mainHall"], ["updated_at", "2014-11-10 10:01:51.830636"]]

  def update
    @template.update(template_params)
---
UPDATE "templates" SET "jumbotron_available" = $1, "template_sub_type" = $2, "template_type" = $3, "updated_at" = $4 WHERE "templates"."id" = 1  [["jumbotron_available", "f"], ["template_sub_type", "Main Hall"], ["template_type", "Main Hall"], ["updated_at", "2014-09-12 13:51:16.357632"]]