app/views/halls/exhibition_hall/_booths_booth.html.haml

SELECT "templates".* FROM "templates"  WHERE "templates"."id" IN (4)
---
  -#.info-centre
  -#  = link_to image_tag(booth.template.thumbnail_image.assets.url, alt: booth.name), booths_visit_path(booth) if booth.template.thumbnail_image.present?