app/views/layouts/_user_nav.html.haml

SELECT "events".* FROM "events"
---
    %header.navbar-header
      -if @event.present? && @event.id.present? && @event.event_favicon.present?

SELECT "halls".* FROM "halls"  WHERE "halls"."event_id" = $1  [["event_id", 1]]
---
            -if @current_event.live?
              = render partial: '/layouts/user_nav_hall_button', locals: { halls: @event.knowledge_hall_tag_hall} if @event.knowledge_hall_tag_hall.present?