app/views/layouts/_user_nav_hall_button.haml

-isActive = halls[0].present? && (@hall.present? && @hall.template.template_type == halls[0].template.template_type) or (@content.present? and @content.halls.select {|hall| hall.template.template_type == halls[0].template.template_type}.size > 0)
---
SELECT  "templates".* FROM "templates"  WHERE "templates"."id" = $1 LIMIT 1  [["id", 2]]